INSERT INTO MEMBER(CREATED_AT, ID, MODIFIED_AT, EMAIL, MEMBER_ID, MEMBER_LOGIN_TYPE, MEMBER_PWD, MEMBER_ROLE, MEMBER_STATUS, NAME, PROFILE_IMAGE)VALUES('2023-11-27 21:27:04.311703', 1, '2023-11-27 21:27:04.311703', 'guncode4545@gmail.com', '12341234', 'MEMBER_BASIC', '$2a$10$UIRsVAu1wrCo755PmydBp.jupEjKklBzhwjH/m39KsCmBH7ex9KWe', 'ROLE_ADMIN', 'MEMBER_ACTIVE', 'null', 'basicuser.svg');
INSERT INTO LOCATION(CREATED_AT, ID, MODIFIED_AT, NAME) VALUES
                                                            ('2023-11-27 21:27:04.311703', 1, '2023-11-27 21:27:04.311703', '경기'),
                                                            ('2023-11-27 21:27:04.311703', 2, '2023-11-27 21:27:04.311703', '제주도'),
                                                            ('2023-11-27 21:27:04.311703', 3, '2023-11-27 21:27:04.311703', '충남'),
                                                            ('2023-11-27 21:27:04.311703', 4, '2023-11-27 21:27:04.311703', '인천'),
                                                            ('2023-11-27 21:27:04.311703', 5, '2023-11-27 21:27:04.311703', '대구'),
                                                            ('2023-11-27 21:27:04.311703', 6, '2023-11-27 21:27:04.311703', '대전'),
                                                            ('2023-11-27 21:27:04.311703', 7, '2023-11-27 21:27:04.311703', '서울'),
                                                            ('2023-11-27 21:27:04.311703', 8, '2023-11-27 21:27:04.311703', '경남'),
                                                            ('2023-11-27 21:27:04.311703', 9, '2023-11-27 21:27:04.311703', '부산'),
                                                            ('2023-11-27 21:27:04.311703', 10, '2023-11-27 21:27:04.311703', '전북'),
                                                            ('2023-11-27 21:27:04.311703', 11, '2023-11-27 21:27:04.311703', '울산'),
                                                            ('2023-11-27 21:27:04.311703', 12, '2023-11-27 21:27:04.311703', '광주'),
                                                            ('2023-11-27 21:27:04.311703', 13, '2023-11-27 21:27:04.311703', '강원'),
                                                            ('2023-11-27 21:27:04.311703', 14, '2023-11-27 21:27:04.311703', '경북'),
                                                            ('2023-11-27 21:27:04.311703', 15, '2023-11-27 21:27:04.311703', '전남'),
                                                            ('2023-11-27 21:27:04.311703', 16, '2023-11-27 21:27:04.311703', '충북'),
                                                            ('2023-11-27 21:27:04.311703', 17, '2023-11-27 21:27:04.311703', '세종');
INSERT INTO THEME(CREATED_AT, ID, MODIFIED_AT, NAME) VALUES
                                                            ('2023-11-27 21:27:04.311703', 1, '2023-11-27 21:27:04.311703', '방'),
                                                            ('2023-11-27 21:27:04.311703', 2, '2023-11-27 21:27:04.311703', '시골'),
                                                            ('2023-11-27 21:27:04.311703', 3, '2023-11-27 21:27:04.311703', '캠핑장'),
                                                            ('2023-11-27 21:27:04.311703', 4, '2023-11-27 21:27:04.311703', '한옥'),
                                                            ('2023-11-27 21:27:04.311703', 5, '2023-11-27 21:27:04.311703', '해변'),
                                                            ('2023-11-27 21:27:04.311703', 6, '2023-11-27 21:27:04.311703', '수영장'),
                                                            ('2023-11-27 21:27:04.311703', 7, '2023-11-27 21:27:04.311703', '키즈');
INSERT INTO ROOM (ID, RATING, CREATED_AT, LOCATION_ID, MODIFIED_AT, PRICE, THEME_ID, ADDRESS, DESCRIPTION, LOCATIONX, LOCATIONY, NAME)
VALUES (1, 0.0, '2023-11-29 23:19:51.772405', 10, '2023-11-29 23:19:51.772405', 80000, 1, '전북 전주시 덕진구 금암동 710-16,전북 전주시 덕진구 금암동 710-16', '리옹 중심부에서 여러분을 맞이하기 위해 양질의 자재로 리노베이션된 아파트의 개인 욕실을 갖춘 객실입니다. 신화 속 크루아 루스 언덕에서 발견할 수 있는 멋진 놀라움이 여러분을 기다리고 있습니다. 푸르른 분위기의 조용하고 매력적인 숙소: 진정한 럭셔리. 그리고 리옹에게는 탁월합니다. 주차장은 매우 쉽게 찾을 수 있습니다. 😊', 127.13124498299196, 35.839275388770126, '전용 정원, 조용하고 편리한 주차 공간');
INSERT INTO ROOM_IMAGE (ID, CREATED_AT, MODIFIED_AT, ROOM_ID, IMAGE, IS_MAIN)
VALUES (1, '2023-11-29 23:20:18.111559', '2023-11-29 23:20:18.111559', 1, 'dec34dbe-5808-4d66-8661-a0aa0d7e15f1.jpg', TRUE);
INSERT INTO ROOM_IMAGE (ID, CREATED_AT, MODIFIED_AT, ROOM_ID, IMAGE, IS_MAIN)
VALUES (2, '2023-11-29 23:20:21.212384', '2023-11-29 23:20:21.212384', 1, 'd5795b0d-fca5-4a85-a41c-31ffc5099226.jpg', FALSE);
INSERT INTO ROOM_IMAGE (ID, CREATED_AT, MODIFIED_AT, ROOM_ID, IMAGE, IS_MAIN)
VALUES (3, '2023-11-29 23:20:23.171339', '2023-11-29 23:20:23.171339', 1, 'a50d1998-0897-4ca6-9a46-c8e2f0bff0fe.jpg', FALSE);
INSERT INTO ROOM_IMAGE (ID, CREATED_AT, MODIFIED_AT, ROOM_ID, IMAGE, IS_MAIN)
VALUES (4, '2023-11-29 23:20:25.492835', '2023-11-29 23:20:25.492835', 1, 'f492bcea-31bb-4aea-bc2f-147ca9a2b44f.jpg', FALSE);
INSERT INTO ROOM_IMAGE (ID, CREATED_AT, MODIFIED_AT, ROOM_ID, IMAGE, IS_MAIN)
VALUES (5, '2023-11-29 23:20:28.060675', '2023-11-29 23:20:28.060675', 1, '966154ff-2614-4cbc-a946-26445f295d67.jpg', FALSE);


